artilleryTest.yaml
config:
  target: "http://localhost:3005"
  phases:
    - duration: 5
      arrivalRate: 10
      name: "Warming up"
    - duration: 10
      arrivalRate: 20
      rampTo: 100
      name: "Ramping up"
    - duration: 1
      arrivalRate: 1000
      name: "Sustained load"

scenarios:
  - name: "Load testing"
    flow:
      - get:
          url: "/qa/questions"
          qs:
            product_id: 23